# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Модуль statistics ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
import statistics
print(statistics.mean())

# mean()	Среднее арифметическое («среднее») данных.
# fmean()	Быстрое арифметическое с плавающей точкой.
# geometric_mean()	Среднее геометрическое данных.
# harmonic_mean()	Гармоническое среднее данных.
# median()	Медиана (среднее значение) данных.
# median_low()	Низкая медиана данных.
# median_high()	Высокая медиана данных.
# median_grouped()	Медиана или 50й процентиль сгруппированных данных.
# mode()	Одиночный режим (наиболее распространенное значение) дискретных или номинальных данных.
# multimode()	Список режимов (наиболее распространенных значений) дискретных или номинальных данных.
# quantiles()	Разделение данных на интервалы с равной вероятностью.
